---
kind: other
id: Methods.T:Autodesk.Revit.DB.IFC.IFCData
source: html/107f716d-8033-5a73-39f2-3fd559ee18dc.htm
---
# IFCData Methods

Gets storage value as IFCAggregate when its PrimitiveType is aggregate.